Конфигурация/Catalogs/ЗначенияНастроекОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЗначенияНастроекОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ЗначенияНастроекОтчетов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗначенияНастроекОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗначенияНастроекОтчетов КАК ЗначенияНастроекОтчетов
		|ГДЕ
		|	ЗначенияНастроекОтчетов.НастройкаОтчета = &НастройкаОтчета
		|	И ЗначенияНастроекОтчетов.Ключ = &Ключ
		|	И ЗначенияНастроекОтчетов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ключ", ЭтотОбъект.Ключ);
	Запрос.УстановитьПараметр("НастройкаОтчета", ЭтотОбъект.НастройкаОтчета);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекстОшибки = СтрШаблон("Для настройки ""%1"" уже существует значение с ключом ""%2""", ЭтотОбъект.НастройкаОтчета.Наименование, ЭтотОбъект.Ключ);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;

КонецПроцедуры
